my-app/server/artillery_tests/products.yml
config:
  target: "http://localhost:3000"
  http:
    # Responses have to be sent within 10 seconds, or an `ETIMEDOUT` error gets raised.
    timeout: 10
  phases:
    - name: Testing Products
      duration: 20
      arrivalRate: 5
      rampTo: 5
scenarios:
  # - name: Get products
  #   flow:
  #     - get:
  #         url: "/products/"
  # - name: Get product
  #   flow:
  #     - get:
  #         url: "/products/{{ $randomNumber(1, 1000000) }}"
  # - name: Get styles
  #   flow:
  #     - get:
  #         url: "/products/{{ $randomNumber(1, 1000000) }}/styles"
  - name: Get related
    flow:
      - get:
          url: "/products/{{ $randomNumber(1, 1000000) }}/related"